CSI API ETABS v1
cAnalysisResults.ModalParticipatingMassRatios Method
 Reports the modal participating mass ratios for each mode of each selected modal analysis case
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int ModalParticipatingMassRatios(
	ref int NumberResults,
	ref string[] LoadCase,
	ref string[] StepType,
	ref double[] StepNum,
	ref double[] Period,
	ref double[] UX,
	ref double[] UY,
	ref double[] UZ,
	ref double[] SumUX,
	ref double[] SumUY,
	ref double[] SumUZ,
	ref double[] RX,
	ref double[] RY,
	ref double[] RZ,
	ref double[] SumRX,
	ref double[] SumRY,
	ref double[] SumRZ
)
Function ModalParticipatingMassRatios (
	ByRef NumberResults As Integer,
	ByRef LoadCase As String(),
	ByRef StepType As String(),
	ByRef StepNum As Double(),
	ByRef Period As Double(),
	ByRef UX As Double(),
	ByRef UY As Double(),
	ByRef UZ As Double(),
	ByRef SumUX As Double(),
	ByRef SumUY As Double(),
	ByRef SumUZ As Double(),
	ByRef RX As Double(),
	ByRef RY As Double(),
	ByRef RZ As Double(),
	ByRef SumRX As Double(),
	ByRef SumRY As Double(),
	ByRef SumRZ As Double()
) As Integer
Dim instance As cAnalysisResults
Dim NumberResults As Integer
Dim LoadCase As String()
Dim StepType As String()
Dim StepNum As Double()
Dim Period As Double()
Dim UX As Double()
Dim UY As Double()
Dim UZ As Double()
Dim SumUX As Double()
Dim SumUY As Double()
Dim SumUZ As Double()
Dim RX As Double()
Dim RY As Double()
Dim RZ As Double()
Dim SumRX As Double()
Dim SumRY As Double()
Dim SumRZ As Double()
Dim returnValue As Integer
returnValue = instance.ModalParticipatingMassRatios(NumberResults,
	LoadCase, StepType, StepNum, Period,
	UX, UY, UZ, SumUX, SumUY, SumUZ, RX,
	RY, RZ, SumRX, SumRY, SumRZ)
int ModalParticipatingMassRatios(
	int% NumberResults,
	array<String^>^% LoadCase,
	array<String^>^% StepType,
	array<double>^% StepNum,
	array<double>^% Period,
	array<double>^% UX,
	array<double>^% UY,
	array<double>^% UZ,
	array<double>^% SumUX,
	array<double>^% SumUY,
	array<double>^% SumUZ,
	array<double>^% RX,
	array<double>^% RY,
	array<double>^% RZ,
	array<double>^% SumRX,
	array<double>^% SumRY,
	array<double>^% SumRZ
)
abstract ModalParticipatingMassRatios :
        NumberResults : int byref *
        LoadCase : string[] byref *
        StepType : string[] byref *
        StepNum : float[] byref *
        Period : float[] byref *
        UX : float[] byref *
        UY : float[] byref *
        UZ : float[] byref *
        SumUX : float[] byref *
        SumUY : float[] byref *
        SumUZ : float[] byref *
        RX : float[] byref *
        RY : float[] byref *
        RZ : float[] byref *
        SumRX : float[] byref *
        SumRY : float[] byref *
        SumRZ : float[] byref -> int
Parameters
NumberResults
Type: System.Int32
 The total number of results returned by the program
LoadCase
Type: System.String[]
 This is an array that includes the name of the modal load case associated with each result
StepType
Type: System.String[]
 This is an array that includes the step type, if any, for each result. For modal results, this will always be Mode
StepNum
Type: System.Double[]
 This is an array that includes the step number for each result. For modal results, this is always the mode number
Period
Type: System.Double[]
 This is an array that includes the period for each result. [s]
UX
Type: System.Double[]
 This is an array that includes the modal participating mass ratio for the structure Ux degree of freedom. The ratio applies to the specified mode
UY
Type: System.Double[]
 This is an array that includes the modal participating mass ratio for the structure Uy degree of freedom. The ratio applies to the specified mode
UZ
Type: System.Double[]
 This is an array that includes the modal participating mass ratio for the structure Uz degree of freedom. The ratio applies to the specified mode
SumUX
Type: System.Double[]
 This is an array that includes the cumulative sum of the modal participating mass ratios for the structure Ux degree of freedom
SumUY
Type: System.Double[]
 This is an array that includes the cumulative sum of the modal participating mass ratios for the structure Uy degree of freedom
SumUZ
Type: System.Double[]
 This is an array that includes the cumulative sum of the modal participating mass ratios for the structure Uz degree of freedom
RX
Type: System.Double[]
 This is an array that includes the modal participating mass ratio for the structure Rx degree of freedom. The ratio applies to the specified mode
RY
Type: System.Double[]
 This is an array that includes the modal participating mass ratio for the structure Ry degree of freedom. The ratio applies to the specified mode
RZ
Type: System.Double[]
 This is an array that includes the modal participating mass ratio for the structure Rz degree of freedom. The ratio applies to the specified mode
SumRX
Type: System.Double[]
 This is an array that includes the cumulative sum of the modal participating mass ratios for the structure Rx degree of freedom
SumRY
Type: System.Double[]
 This is an array that includes the cumulative sum of the modal participating mass ratios for the structure Ry degree of freedom
SumRZ
Type: System.Double[]
 This is an array that includes the cumulative sum of the modal participating mass ratios for the structure Rz degree of freedom
Return Value
Type: Int32
 Returns zero if the data is successfully recovered; otherwise it returns a nonzero value
Remarks
 See Results for more information.
Examples
Public Sub Example()
   'dimension variables
   Dim SapObject as cOAPI
   Dim SapModel As cSapModel
   Dim ret As Integer = -1
   Dim NumberResults As Integer
   Dim LoadCase() As String
   Dim StepType() As String
   Dim StepNum() As Double
   Dim Period() As Double
   Dim Ux() As Double
   Dim Uy() As Double
   Dim Uz() As Double
   Dim SumUx() As Double
   Dim SumUy() As Double
   Dim SumUz() As Double
   Dim Rx() As Double
   Dim Ry() As Double
   Dim Rz() As Double
   Dim SumRx() As Double
   Dim SumRy() As Double
   Dim SumRz() As Double
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'run analysis
       System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
       ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
       ret = SapModel.Analyze.RunAnalysis()
   'deselect all cases and combos
       ret = SapModel.Results.Setup.DeselectAllCasesAndCombosForOutput()
   'set case selected for output
       ret = SapModel.Results.Setup.SetCaseSelectedForOutput("MODAL")
   'get modal participating mass ratios
       ret = SapModel.Results.ModalParticipatingMassRatios(NumberResults, LoadCase, StepType, StepNum, Period, Ux, Uy, Uz, SumUx, SumUy, SumUz, Rx, Ry, Rz, SumRx, SumRy, SumRz)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cAnalysisResults Interface
ETABSv1 Namespace